package com.rsc.ckl.boottest.ct;

/**
 * @author chenkuilin
 * @date 2022/3/31
 * @desc
 */
public class TestController {

    public void directRecharge(){

        //直冲

        //1.查询商品信息

        //2.查询当前渠道是否有充值该商品的权限

        //判断余额是否充值  判断当前余额是否具备充值当前商品的价格

        //3.定制充值对象

        //4.判断供应商，根据不同供应商进行充值

    }

    //api充值

    //判断参数是否正常（MD5进行校验）

    //查询当前渠道是否有充值该商品的权限

    //判断渠道是否正常  判断余额是否充值  判断当前余额是否具备充值当前商品的价格

    //3.定制充值对象

    //4.判断供应商，根据不同供应商进行充值


    //余额重做

    //1.商品 品牌 分类 这些列表哪些人能看 还是都能看？
    //2.如果都能看，代理商是能看到所有商品还是只能看到授权过的商品

}
